---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoofsSpacesBoundingWarn
source: html/fd8afc78-4eb2-0a44-4714-d2247b58ce86.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoofsSpacesBoundingWarn Property

The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are space bounding, and make sure that the space offsets are high enough to include the roofs.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRoofsSpacesBoundingWarn { get; }
```